{
	"en": {
		"message": {
			"hello": "hello world"
		},
		"language": {
			"en": "English",
			"de": "German"
		},
		"toasts": {
			"signedIn": "You have successfully been signed in.",
			"signedOff": "You have successfully been signed off.",
			"wrongPassword": "The combination of your e-mail/password is incorrect.",
			"unauthorized": "You are trying to access a protected resource. Please authenticate yourself first.",
      "accountrequired": "You are trying to access a page without having a Bazo account. Please add an account first.",
			"forbidden": "You do not have the permission to access this site.",
			"internalError": "An internal error occured. The page will be reloaded.",
			"sessionExpired": "Your session has expired. Please sign in again.",
			"pageNotFound": "404 - The page could not be found. You've been redirected.",
			"validationError": "Please fill out all fields correctly.",
			"languageSwitched": "Your language setting has successfully been switched to {language}.",
			"userIsDeletedError": "This user account was deleted or can only be used with a special token. Please contact the administrator.",
			"offlineError": "<i class='fa fa-wifi'></i>&nbsp;Your request was not successful, because you are currently offline.",
			"offlineModeRedirect": "<i class='fa fa-wifi'></i>&nbsp;You cannot access this page, because you are currently&nbsp;<b>offline</b>."
		},
    "userAccounts": {
			"title": "Accounts",
			"total": "Total",
			"noActionsPossible": "No action possible.",
      "notConfigured": "You need to add a Bazo Account first!",
      "save": "Save account",
			"paymentError": "An error occurred. Please try it again later on.",
      "description": "You currently store the following accounts:",
			"transferButton": "Transfer",
			"transferDescription": "Transfer money from this account by issueing a new payment.",
      "tradeButton": "Exchange",
      "tradeDescription": "Exchange your Bazo coins back to surprise points by issueing a request.",
			"reload": "Reload",
			"fields": {
				"bazoaddress": "Bazo Address",
        "bazoname": "Name",
        "prime": "Main account?",
				"qr": "QR Code",
        "balance": "Balance",
				"actions": "Actions"
			},
      "makePrimary": "Mark this account as your main account?",
			"alerts": {
				"success": {
					"moveFunds": "The amount was successfully transferred to the locked account. This transaction may be pending for up to an hour.",
					"createNewAddress": "Your new address was successfully created. Transfer your funds to this address to make payments in Coinblesk. You can directly move your funds from previous addresses to your new address on this page.",
					"payout": "Your virtual balance was transferred successfully to your locked address. The transaction may be pending for up to an hour."
				},
				"error": {
					"moveFunds": "An error occurred during the transaction of the funds. Please try it again later.",
					"createNewAddress": "An error occurred during the creation of a new address. Please try it again later.",
					"payout": "An error occurred during the pay out. Please try it again later."
				}
			}
		},
    "userSend": {
			"title": "Transfer Bazo coins",
			"boxTitle": "Transfer to a Bazo address",
			"receiver": "Receiver (Bazo address)",
			"receiverPlaceholder": "Enter a valid bazo address",
			"receiverDescription": "This should be the fully qualified Bazo address whom you're trying to send Bazo coins.",
			"lookup": "Lookup",
			"amount": "Amount",
			"feesIncluded": "Fees are included in the amount",
			"feesIncludedDescription": "If the checkbox is checked the fees are subtracted from the transfer amount. The recepient receives an amount which is reduced by the extend of the fees. Alternatively, you are charged by the amount plus fees, the recepient, however, receives the exact amount.",
			"maxAmount": "Maximal amount",
			"maxAmountDescription": "The maximal amount relates to the currently maximal amount which can be transferred to another account. If you have a virtual balance (see <i>Funds</i>), you can pay out these funds to transfer it to another Bazo address. E-mail addresses as recipients can either receive funds from virtual balances or from time locked address, which are currently locked.",
			"maxAmountDescriptionIntro": "Please enter an address first, before you can see the maximal amount.",
      "accountUsed": "Bazo Account",
      "accountUsedDesccription": "Please choose one of your Bazo accounts as a source for the transaction.",
      "descriptionForexRate": "The current forex rate Bazo/{currency} is <span class='mono'>{forex}</span>&nbsp;&nbsp;().",
			"descriptionFees": "The fees of your Bazo transfer are not yet included in the amount and are added to the value. Please make sure, that you have enough funds to create this transaction. Otherwise we have to reject it.",
			"lowAmountFeeDescription": "The amount you are trying to transfer is very small and needs to contain possible transaction fees. It is possible, that the transaction is rejected because the fees might be higher than the remaining transfer amount.",
			"button": "Send {amount} Bazo coins",
			"transactionSuccessful": "The transaction was successfully executed.",
			"paymentError": "An error occurred during the payment process. Please verify the amount (Attention: fees) or try it again later on.",
      "openNFCTitle": "Watch for a Bazo adress over NFC",
      "NFCTitle": "Read payment info from an NFC tag",
      "NFCNotice": "If the NFC message was not detected, your phone or Browser might not support NFC.",
      "NFCNotSupported": "Your browser or device does not support NFC.",
      "NFCSendError": "Error trying to send to NFC devicessss:",
      "NFCSending": "Trying to send to nearby NFC devices..",
      "NFCSendSuccess": "Payment information was transferred successfully!",
      "openBTTitle": "Receive payment info over Bluetooth",
      "BTTitle": "Receive payment info over Bluetooth",
      "BTNotice": "If no devices are showing up your device or browser might not support Bluetooth.",
      "BTNotSupported": "Your browser or device does not support Bluetooth.",
      "openCameraTitle": "Scan a QR Code of a Bazo address",
			"cameraTitle": "Scan a QR code with a Bazo address",
			"cameraError": "The camera could not be accessed.",
			"cameraNotice": "If the camera does not show up here within 5s, you probably did not grant the camera the required permission.",
			"errorRecipientAddress": "This address can currently not receive funds in the specified amount.",
			"paymentErrorNotYetConfirmed": "Your funds have not been confirmed in enough blocks and can therefore not been spent yet.",
      "amountQueryError": "Unable to query the transaction amount.",
      "sendError": "The transaction could not be sent to the Bazo network.",
      "sendSuccess": "The transaction was successfully sent to the Bazo network."
    },
    "userRequest": {
      "title": "Request Bazo Coins",
      "boxTitle": "Transfer Payment information",
      "accountUsed": "Payment information",
      "paymentInfo": "Please select the account for which you wish to receive the stated amount of Bazo Coins.",
      "transfertype": "Send payment information",
      "BTNotSupported": "Your browser or device does not support Bluetooth.",
      "NFCNotSupported": "Your browser or device does not support NFC.",
      "NFCSendError": "Error trying to send to NFC devicessss:",
      "NFCSending": "Trying to send to nearby NFC devices..",
      "NFCSendSuccess": "Payment information was transferred successfully!",
      "NFCSendAborted": "Please keep the devices close together. Retrying...",
      "QRTitle": "Transfer via QR Code",
      "QRNotice": "Show this QR Code to the sending party of the payment.",
      "NFCTitle": "Transfer to NFC tag",
      "NFCNotice": "Hold your device to an NFC Tag to transfer the payment information.",
      "BTTitle": "Transfer to a Bluetooth device.",
      "BTNotice": "If no devices are showing, then there might not be any or your browser or phone does not support Bluetooth.",
      "posid": "POS Identification",
      "posiddescription": "Supply an ID that corresponds to the POS System so that the amount of the transaction can be queried."
    },
		"general": {
			"rowsPerPage": "Rows per page"
		}
	},
	"de": {
		"message": {
			"hello": "Hallo Welt"
		},
		"language": {
			"en": "Englisch",
			"de": "Deutsch"
		},
    "userAccounts": {
			"title": "Konti",
			"totalFunds": "Total",
      "description": "Sie haben folgende Bazo-Adressen hinterlegt:",
			"noActionsPossible": "Keine Aktion möglich.",
      "notConfigured": "Bitte fügen Sie zuerst ein Bazo Konto hinzu!",
      "save": "Konto speichern",
			"paymentError": "Ein Fehler ist aufgetreten. Versuchen Sie es später noch einmal.",
			"transferButton": "Transferieren",
			"transferDescription": "Transferieren Sie Coins von diesem Account in dem Sie eine neue Zahlung tätigen",
      "tradeButton": "Tauschen",
      "tradeDescription": "Tauschen Sie Ihre Bazo Coins zurück zu Surprise Punkten indem Sie eine Anforderung erstellen.",
			"reload": "Aktualisieren",
			"fields": {
				"bazoaddress": "Bazo Adresse",
        "prime": "Hauptkonto?",
				"qr": "QR Code",
        "balance": "Guthaben",
				"actions": "Aktionen"
			},
      "makePrimary": "Dieses Konto als Hauptkonto hinterlegen",
			"alerts": {
				"success": {
					"moveFunds": "Der Betrag ist erfolgreich auf das gesperrte Konto überwiesen worden. Die Transaktion kann bis zu einer Stunde dauern.",
					"createNewAddress": "Ihre neue Adresse wurde erfolgreich erstellt. Überweisen Sie Guthaben auf diese Adresse, um Zahlungen zu tätigen. Sie können das Guthaben von vorherigen Adressen hier direkt auf Ihre neue Adresse überweisen.",
					"payout": "Ihr virtuelles Saldo wurde erfolgreich auf Ihre gesperrte Adresse überwiesen. Die Transaktion kann bis zu einer Stunde dauern."
				},
				"error": {
					"moveFunds": "Es ist ein Fehler beim Überweisen aufgetreten. Bitte versuchen Sie es später erneut.",
					"createNewAddress": "Es ist ein Fehler beim Erstellen einer neuen Adresse aufgetreten. Bitte versuchen Sie es später erneut.",
					"payout": "Es ist ein Fehler beim Auszahlen aufgetreten. Bitte versuchen Sie es später erneut."
				}
			}
		},
    "userSend": {
			"title": "Bazo coins überweisen",
			"boxTitle": "An eine Bazo Adresse überweisen",
			"receiver": "Empfänger (Bazo Adresse)",
			"receiverPlaceholder": "Bazo Adresse eingeben",
			"receiverDescription": "Falls Sie eine E-Mail Adresse eingeben wird der Empfänger eine Nachricht mit einem Schlüssel erhalten. Mit diesem Schlüssel hat er Zugriff auf die erhaltenen Beträge.",
			"lookup": "Suchen",
			"amount": "Betrag",
			"feesIncluded": "Spesen in Betrag einschliessen",
			"feesIncludedDescription": "Wenn die Auswahlbox ausgewählt ist, werden die Spesen vom Betrag abgezogen. Der Empfänger erhält einen um die Spesen verminderten Betrag. Andernfalls wird Ihnen der Betrag plus Spesen berechnet, der Empfänger erhält jedoch den genauen Betrag.",
			"maxAmount": "Maximalbetrag",
			"maxAmountDescription": "Der Maximalbetrag stellt den aktuell höchst möglichen Zahlungsbetrag dar. Falls Sie virtuelles Guthaben haben (siehe <i>Guthaben</i>) können Sie sich dieses Guthaben zunächst auzahlen lassen um an eine Bazo-Adresse zu zahlen. E-Mail Adressen können entweder Guthaben aus virtuellem Guthaben oder aber Guthaben auf zeitlich gesperrten Adressen beinhalten.",
			"maxAmountDescriptionIntro": "Geben Sie zunächst eine Adresse ein, um den Maximalbetrag zu sehen.",
      "accountUsed": "Bazo Konto",
      "descriptionForexRate": "Der aktuelle Wechselkurs Bazo/{currency} beträgt <span class='mono'>{forex}</span>&nbsp;&nbsp;(Quelle: Bitstamp).",
			"descriptionFees": "Bei Ihrer Zahlung entstehen voraussichtlich Spesen, welche auf den dargestellten Betrag aufaddiert werden. Vergewissern Sie sich, dass Sie über genügend Bazo coins verfügen, um die Zahlung auszuführen. Andernfalls müssen wir die Zahlung ablehnen.",
			"lowAmountFeeDescription": "Der Betrag, den Sie überweisen möchten ist klein und beinhaltet bereits allfällige Spesen. Womöglich wird diese Transaktion abgelehnt, da die Spesen höher sein könnten als der verbleibende Überweisungsbetrag.",
			"button": "{amount} Bazo versenden",
			"transactionSuccessful": "Die Transaktion wurde erfolgreich durchgeführt.",
			"paymentError": "Bei der Zahlung ist ein Fehler aufgetreten. Überprüfen Sie Ihren Betrag (Achtung: Spesen) oder probieren Sie es später erneut.",
      "openNFCTitle": "Eine Bazo Adresse von einem NFC Tag lesen.",
      "NFCTitle": "Berühren Sie ein NFC Tag.",
      "NFCNotice": "If the NFC was not detected, your phone or Browser might not support NFC.",
      "NFCNotSupported": "Ihr Gerät oder Browser unterstützt kein NFC.",
      "openBTTitle": "Eine Bazo Adresse über Bluetooth lesen.",
      "BTTitle": "Lesen Sie eine Bazo Adresse über Bluetooth",
      "BTNotice": "Falls keine Geräte gefunden werden, unterstütz ihr Browser oder Gerät kein Bluetooth.",
      "BTNotSupported": "Ihr Gerät oder Browser unterstützt kein Bluetooth.",
			"openCameraTitle": "QR Code einer Bazo Adresse scannen",
			"cameraTitle": "Scannen Sie einen QR Code mit einer Bazo Adresse",
			"cameraError": "Die Kamera kann nicht angezeigt werden.",
			"cameraNotice": "Falls die Kamera nicht in 5s angezeigt wird, haben Sie vermutlich keine Berechtigung für die Kamera vergeben.",
			"errorRecipientAddress": "An diese Adresse kann derzeit kein Guthaben in dieser Höhe überwiesen werden.",
			"paymentErrorNotYetConfirmed": "Ihr Guthaben ist noch nicht in genügend Blöcken bestätigt und kann deshalb noch nicht ausgegeben werden.",
      "amountQueryError": "Fehler beim Abfragen der Transaktionshöhe.",
      "sendError": "Die Transaktion konnte nicht ins Bazo Netzwerk gesendet werden.",
      "sendSuccess": "Die Transaktion wurde erfolgreich <b>versendet</b>."
    },
    "userRequest": {
      "title": "Bazo Coins anfordern",
      "boxTitle": "Zahlungsinformationen",
      "accountUsed": "Zahlungsinformationen",
      "paymentInfo": "Bitte wählen Sie Menge und Empfängeraccount, welche Sie der Zahlenden Partei nennen wollen.",
      "accountUsedDescription": "Wählen Sie den Account den Sie der Zahlenden Partei als Ziel nennen wollen.",
      "transfertype": "Zahlungsinformationen übertragen:",
      "BTNotSupported": "Ihr Gerät oder Browser unterstützt kein Bluetooth.",
      "NFCNotSupported": "Ihr Gerät oder Browser unterstützt kein NFC.",
      "NFCSendError": "Fehler beim Senden über NFC:",
      "NFCSending": "Senden an Geräte in der Umgebung..",
      "NFCSendSuccess": "Zahlungsinformationen wurden übertragen!",
      "NFCSendAborted": "Bitte halten Sie die Geräte nah beieinander. Wiederholen..",
      "QRNotice": "Lassen Sie den erzeugten QR Code scannen.",
      "QRTitle": "Zahlungsinformationen als QR Code",
      "NFCTitle": "Auf NFC Tag übertragen.",
      "NFCNotice": "Halten sie Ihr Gerät an ein NFC Tag um die Zahlungsinformationen darauf zu übertragen.",
      "BTTitle": "An Bluetooth Gerät senden",
      "BTNotice": "Falls keine Geräte wählbar sind, kann es sein dass ihr Gerät oder Browser kein Bluetooth unterstützt.",
      "posid": "POS Identifikation",
      "posiddescription": "Geben Sie die Identifikation des POS Systems an um die Höhe der Transaktion automatisch abrufen zu lassen."
    },
		"toasts": {
			"signedIn": "Sie haben sich erfolgreich eingeloggt.",
			"signedOff": "Sie wurden erfolgreich ausgeloggt.",
			"wrongPassword": "Die Kombination aus Ihrer E-Mail Adresse und Ihrem Passwort ist inkorrekt.",
      "accountrequired": "Sie versuchen eine Seite aufzurufen ohne eine gültige Bazo Adresse hinterlegt zu haben.",
			"unauthorized": "Sie versuchen eine geschützte Seite aufzurufen, bitte loggen Sie sich zunächst ein.",
			"forbidden": "Sie verfügen nicht über die Berechtigung, diese Seite anzuzeigen.",
			"internalError": "Ein interner Fehler ist aufgetreten. Die Seite wird automatisch neu geladen.",
			"sessionExpired": "Ihre Sitzung ist abgelaufen. Bitte melden Sie sich erneut an.",
			"pageNotFound": "404 - Die Seite wurde nicht gefunden. Sie wurden weitergeleitet.",
			"validationError": "Bitte füllen Sie alle Felder korrekt aus.",
			"languageSwitched": "Ihre Spracheinstellung wurde erfolgreich auf {language} geändert.",
			"userIsDeletedError": "Dieses Benutzerkonto wurde deaktiviert oder kann nur mit einem Spezialschlüssel benutzt werden. Bitte kontaktieren Sie den Administrator.",
			"offlineError": "<i class='fa fa-wifi'></i>&nbsp;Ihre Anfrage war nicht erfolgreich, da Sie&nbsp;<b>offline</b>&nbsp;sind.",
			"offlineModeRedirect": "<i class='fa fa-wifi'></i>&nbsp;Sie können diese Seite nicht aufrufen, da Sie derzeit&nbsp;<b>offline</b>&nbsp;sind."
		},
		"general": {
			"rowsPerPage": "Zeilen pro Seite"
		}
	}
}
